In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Employee.csv')

In [3]:
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

# Create Sample Data: Replace with actual data from data.csv.

In [4]:
data = {
    'age': [22, 24, 21, 25, 23, 20, 19, 26],
    'income': [35000, 42000, 30000, 50000, 38000, 28000, 25000, 45000],
    'Education':["B","M","B","M","B","M","B","M"]
}

# Create DataFrame: Construct a DataFrame from the sample data.

In [6]:
df = pd.DataFrame(data)

In [7]:
df.head()

   age  income Education
0   22   35000         B
1   24   42000         M
2   21   30000         B
3   25   50000         M
4   23   38000         B

# Group by Category: Group the DataFrame by the desired categorical variable

In [8]:
grouped_data = df.groupby('Education')

# Calculate Summary Statistics: Use describe() on the grouped numeric columns ('age' and 'income') to obtain mean, median, standard deviation, minimum, and maximum for each group.

In [9]:
summary_stats = grouped_data[['age', 'income']].describe()

In [11]:
print(grouped_data)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F71C507E80>

In [12]:
print(summary_stats)

            age                                                 income  \
          count   mean       std   min   25%   50%    75%   max  count
Education
B           4.0  21.25  1.707825  19.0  20.5  21.5  22.25  23.0    4.0
M           4.0  23.75  2.629956  20.0  23.0  24.5  25.25  26.0    4.0


              mean          std      min      25%      50%      75%      max
Education
B          32000.0  5715.476066  25000.0  28750.0  32500.0  35750.0  38000.0
M          41250.0  9429.563440  28000.0  38500.0  43500.0  46250.0  50000.0